# Taps
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'
tap 'homebrew/core'
tap 'nicoverbruggen/homebrew-cask'

# Binaries
brew 'awscli'
brew 'bash' # Latest Bash version
brew 'coreutils' # Those that come with macOS are outdated
brew 'docker-machine'
brew 'dotnet'
brew 'ffmpeg'
brew 'gh'
brew 'git'
brew 'gnupg'
brew 'grep'
brew 'httpie'
brew 'hub'
brew 'litecli'
brew 'mackup'
brew 'mas' # Mac App Store manager
brew 'node'
brew 'nvm'
brew 'pkg-config' # https://github.com/driesvints/dotfiles/issues/20
brew 'python@3.9'
brew 'saml2aws'
brew 'sqlite'
brew 'trash' # Manage the Trash bin
brew 'tree' # List directories in a tree structure
brew 'wget'
brew 'zlib' # Needed for Memcached


# Apps
cask '1password'
cask 'amazon-workspaces'
cask 'caffeine'
cask 'dbngin'
cask 'docker'
cask 'figma'
cask 'firefox'
cask 'google-chrome'
cask 'google-drive'
cask 'microsoft-teams'
cask 'postman'
cask 'scroll-reverser'
cask 'sublime-merge'
cask 'sublime-text'
cask 'typora'
cask 'virtualbox'
cask 'visual-studio-code'
cask 'vlc'
cask 'zoom'

# App Store
mas 'Keynote', id: 409183694
mas 'Numbers', id: 409203825
mas 'Messenger', id: 1480068668
mas 'LINE', id: 539883307
mas 'WhatsApp', id: 1147396723
mas 'Pages', id: 409201541
mas 'Dashlane', id: 517914548

